<template>
  <div class="wrapper" style="transform: translateY(10px);">
    <svg
      width="100%"
      viewBox="0 0 1500 1500" xml:space="preserve">
      <g id="レイヤー_1" class="st0">
        <image style="display:inline;overflow:visible;opacity:0.149;" width="2048" height="2048" transform="matrix(0.7324 0 0 0.7324 0 0)">
        </image>
      </g>
      <g id="Tail">
        <path class="st1" d="M1181.98,941.85c67.01,13.03,31.63,90.63-0.79,108.41c-11.15,6.11-17.36,6.09-37.37-6.8
          c-8.98-5.79-39.58-38.82-45.7-36.64c-54.74,19.48,53.35,220.29,53.86,220.2c49.19-3.44,95.47-26.64,130.77-50.01
          c22.57-26.11,67.49-74.87,76.6-127.39c0.36-2.08,40.39-108.6-48.02-200.25c-26.48-27.23-92.45-75.74-180.63-29.65
          c-64.59,33.76-66.65,121.4-66.65,121.4c-4.5,21.61,93.34,135.89,119.53,109.74C1267.43,967.14,1181.98,941.85,1181.98,941.85z"/>
      </g>
      <g id="Body">
        <path class="st1" d="M958.46,775.46c-77.17,49.16-172.88,77.43-243.16,73.17c-62.12-3.76-184.67-15.91-241.37-38.13
          c-29.27-11.47-41.27,85.39-48.8,115.91c-19.81,80.29,21.38,263.39-28.19,329.58c-4.04,5.4-19.57,5.49-25.63,8.46
          c-8.18,4.02-21.09,17.82-26.09,25.43c-3.74,5.69-10.95,17.66-12.26,24.35c-1.56,7.93-2.89,25.38,1.26,32.32
          c5.03,8.4,22.55,20.56,32.18,22.33c41.71,7.63,126.18-17.33,168.55-19.01c31.31-1.24,93,15.07,124.32,15.97
          c28.28,0.82,84.37-9.6,112.29-14.15c35.64-5.81,113.95,0.46,142.87-21.16c9.27-6.93,13.05-32.31,19.25-42.08
          c4.34-6.84,16.91-18.27,24.43-21.27c9.15-3.66,38.13-15.24,39.07-5.42c0.92,9.67-29.23,2.22-38.52,5.06
          c-7.52,2.3-19.46,13.97-23.87,20.48c-5.62,8.29-17.2,25.93-17.74,35.93c-0.6,11.1,4.73,35.39,13.34,42.44
          c6.55,5.36,24.59,7.08,33.05,7.36c8.85,0.29,26.58,0.41,35.4-0.35c14.22-1.21,43.01-3.57,56.47-8.34
          c11.89-4.21,34.75-16.13,43.93-24.77c8.44-7.95,22.13-27.09,27.33-37.45c4.7-9.36,12.88-28.9,14.8-39.2
          c3.04-16.32,3.34-49.75,2.76-66.34c-0.64-18.63-3.27-35.94-5.73-54.42c-4.51-33.9-12.16-64.46-30.49-103.62
          c-15.6-33.32-48.25-103.81-65.63-135.04c-12.89-23.16-32.36-39.83-53.02-83.63C983.48,807.64,969.85,768.21,958.46,775.46z"/>
      </g>
      <g id="Arm_x5F_l">
        <path class="st1" d="M411.66,769.41c-22.42-15.33-37.94,78.74-39.46,105.86c-1.32,23.59-9.65,70.32-10.55,93.93
          c-1.16,30.72,1.84,92.42,6.73,122.77c8.31,51.61,47.87,151.15,48.46,203.43c0.07,6.53-5.24,18.94-6.11,25.41
          c-1.3,9.67-2.11,30.1,1.91,39c3.6,7.97,17.35,19.7,23.56,25.86c4.27,4.23,13.72,6.27,19.18,8.76c2.89,1.32,19.22,7.04,30.17,0.65
          c6.61-3.86,2.89-44.25,6.34-44.45c5.51-0.32-11.43,48.72-5.94,48.17c6.27-0.63,33.44,0.8,39.55-0.77
          c10.18-2.63,31.85-4.32,40.92-9.62c8.52-4.99,22.61-20.21,26.52-29.28c3.72-8.63,6.79-27.6,6.61-37
          c-0.26-13.93-5.78-41.4-7.73-55.19c-6.42-45.53-13.59-137.28-18.58-182.99c-3.59-32.88-12.79-98.41-17.05-131.22
          c-3.72-28.66-0.67-89.47-14.89-114.63C521.58,803.26,466.1,806.64,411.66,769.41z"/>
      </g>
      <g id="Arm_x5F_r">
        <path class="st1" d="M839.69,1407.73c0,0,25.05-1.91,33.35-5.2c5.33-2.11,16.41-5.76,21.05-9.13c5.83-4.24,16.38-14.81,19.32-21.39
          c3.85-8.61,7.13-27.75,6.51-37.17c-0.61-9.26-8.08-26.9-8.28-36.17c-0.42-19.23,13.09-56.2,17.87-74.83
          c11.09-43.24,22.28-132.14,32.73-175.55c6.27-26.03,31.04-75.24,32.71-101.96c2.01-32.19-11.11-110.71-27.92-155.82
          c-6.28-16.84-5.21-12.69-16.05-7.44c-55.05,26.69-86.82,37.14-104.57,42.81c-34.44,11-47.19,7.23-62.08,24.39
          c-43.65,50.31-25.15,146.5-29.74,249.79c-3.09,69.45-4.3,31.65-9.34,135.71c-0.92,19.01-1.23,45.12-6.94,59.12
          c-13.37,32.76-8.47,60.51-6.2,66.47c2.76,7.23,7.88,16.19,13.44,21.56c5.89,5.69,21.49,14.02,29.27,16.58
          C809.65,1410.95,839.69,1407.73,839.69,1407.73z"/>
      </g>
      <g id="Head">
        <g>
          <path class="st2" d="M287.87,539.79c0-181.15,175.77-358,400-358s369.6,151.5,394,331c9.75,71.69-14.98,177.37-92.91,241.93
            c-72.74,60.26-182.97,92.07-295.09,92.07s-237.61-31.71-311.09-91.07S287.87,630.37,287.87,539.79z"/>
          <path class="st2" d="M568.17,207.44c0,0-121.08-136.46-182.09-135.63c-10.26,0.14-33.84,16.11-39.41,24.73
            c-42.44,65.73-20.31,292.21-20.31,292.21"/>
          <path class="st2" d="M799.59,197.44c0,0,121.08-136.46,182.09-135.63c10.26,0.14,33.84,16.11,39.41,24.73
            c42.44,65.73,20.31,292.21,20.31,292.21"/>
        </g>
      </g>
      <g id="Eyes">
        <ellipse class="st3" cx="540.62" cy="488.66" rx="33.5" ry="36"/>
        <ellipse class="st3" cx="831.62" cy="490.66" rx="33.5" ry="36"/>
      </g>
      <g id="Color">
        <g id="Mimi">
          <path class="st4" d="M474.12,234.24c1.61,5.91-67.15,67.27-71.39,70.15c-15.68,10.65-17.91-134.21,6.55-136.24
            C430.04,166.43,465.41,202.18,474.12,234.24z"/>
          <path class="st4" d="M972.2,298.84c-34.73-41.08-75.73-60.12-73-64.97c9.29-16.53,61.27-86.46,74-66.03
            C999.24,209.63,981.75,310.15,972.2,298.84z"/>
        </g>
        <g id="Kai">
          <path class="st4" d="M1064.71,610.97c-23.21,99.89-146.84,211.2-295.61,221.17c-242.26,16.24-374.84-28.53-448.26-174.48
            c-5.31-10.55-27.23-87.75-17.8-99.64c9.59-12.09,154.23-40.63,224.34,27.9c14.08,13.76,300.95,1.8,322.99-9.21
            c133.88-66.91,213.23-21.85,213.23-21.85L1064.71,610.97z"/>
          <ellipse class="st4" cx="679.85" cy="600.45" rx="156.6" ry="99"/>
        </g>
        <ellipse class="st5" cx="688.12" cy="765.11" rx="35" ry="24"/>
        <path class="st6" d="M473.21,821.67c-36.65-20.16,6.37,170.11,37.34,198.07c30.97,27.96,89.27,87.56,132.2,85.12
          c41.43-2.35,159.81-33.97,211.59-101.17c31.61-41.03,93.13-193.69,61.91-194.45c-27.71-0.68-116.17,53.96-215.93,50.98
          c-48.09-1.44-67.8-0.15-131.98-7.75C539.24,849.03,487.51,829.53,473.21,821.67z"/>
      </g>
      <g id="Nose">
        <path class="st3" d="M693.46,569.71c26.22,0.25,38.55-0.83,47.68,16.93c10,19.45-11.25,42.99-37.5,51.8
          c-25.63,8.6-44.72-11.12-49.59-15.86C611.84,581.5,656.99,569.36,693.46,569.71z"/>
      </g>
      <g id="Mouse">
        <path class="st8" d="M690.7,653.41c0,0,2.4,46.52,57.95,53.2c41.39,4.97,63.62-30.74,63.62-30.74"/>
        <path class="st8" d="M689.27,653.41c0,0-2.4,46.52-57.95,53.2c-41.39,4.97-63.62-30.74-63.62-30.74"/>
      </g>
    </svg>
  </div>
</template>

<script setup>
import { ref, onMounted } from 'vue'
import { gsap } from 'gsap'

// てす
onMounted(() => {
  console.log(document.querySelector('.wrapper'));  // クラス名が正しいか確認
  // fromDemo('.wrapper', 0.5); // 下からふわっと表示
  // toDemo('.wrapper');
  test('.wrapper');
});

/** アニメーションの定義 */
/**
 * 下からふわっと、呼出元の位置に出現する
 * 
 * @param {string} targetClass アニメーションを適用する要素のクラス名
 * @param {number} delay 遅延時間（秒）
 * @memo fromメソッドは、第二引数の内容を「開始点」とし、デフォルトの値に進むアニメーションを作成する
 */
 function fromDemo(targetClass, delay = 0.3) {
  gsap.from(targetClass, {
    opacity: 0,         // 初期値として透明にする
    y: 20,              // 初期位置を下に20px移動させる
    duration: 1,        // アニメーションの時間（1秒）
    ease: 'power2.out', // イージングの種類（スムーズな動き）   
    delay: delay,       // アニメーション開始をx秒遅らせる
  });
}

/**
 * 第二引数の位置に消えていく
 * @param targetClass 
 * toメソッドは、デフォルトの値から、第二引数の内容を「終了点」として進むアニメーションを作成する
 */
function toDemo(targetClass) {
  gsap.to(targetClass, {
    opacity: 0,   // 初期値は1で不透明なので…0は消える
    y: 0,         // 初期のtranslateY位置を元(0)にする
    duration: 1, 
    ease: 'power2.out'
  });
}

/**
 * 即座に指定した値に設定する
 * @param targetClass 
 * setメソッドは、アニメーションではなく、値を変更したいときに使う
 */
function setDemo(targetClass) {
  gsap.set(targetClass, {
    opacity: 0,  // 即座に透明にする
    y: 50        // 即座に50px下に移動させる
  });
}

/**
 * アニメーションの開始位置と終了位置を両方指定する
 * @param targetClass 
 * デフォルト値は無視する？→一番便利じゃね、位置だけ？？
 */
 function fromToDemo(targetClass) {
  gsap.fromTo(targetClass,
    { opacity: 0, y: 20 }, // 開始時点のプロパティ
    { opacity: 1, y: 0, duration: 1 } // 終了時点のプロパティ
  );
}

/**
 * 複数のアニメーションを順番に連続で再生する
 * @param targetClass1 
 * @param targetClass2 
 * @param targetClass3 
 * ちょっとよくわかんない
 */
 function timelineDemo(targetClass1, targetClass2, targetClass3) {
  const tl = gsap.timeline();
  tl.to( targetClass1, { opacity: 1, duration: 1 })
    .to( targetClass2, { opacity: 1, duration: 1 })
    .to(targetClass3, { opacity: 1, duration: 1 });
}

/**
 * .item というクラスを持つ要素が複数存在する場合、
 * staggerプロパティを指定すると、値の分だけ、各要素のアニメーションを遅延させて適用することができる
 * ※HTMLに書かれた順番にアニメーションが適用される
 */
function staggerDemo() {
  gsap.from('.item', {
    opacity: 0,
    y: 20,
    duration: 1,
    stagger: 0.2, // 各要素のアニメーションを0.2秒ずつ遅延させて適用
    // オブジェクト形式で、下記にもできる。色々できる！
    stagger: {
      each: 0.2, // 各アイテム0.2秒ずつずらす
      from: "center", // 真ん中から外に向かってアニメーションさせる
    }
  });
}

// gsap.killTweensOf  特定の要素やターゲットに対するアニメーションを停止するためのメソッド

function test(targetClass) {
  
}

</script>

<style scoped>
.st0{display:none;}
.st1{fill:#FFBB4D;stroke:#000000;stroke-width:30;stroke-linecap:round;stroke-linejoin:round;stroke-miterlimit:10;}
.st2{fill:#FFBB4D;stroke:#000000;stroke-width:30;stroke-miterlimit:10;}
.st3{stroke:#000000;stroke-width:18.0806;stroke-linecap:round;stroke-linejoin:round;stroke-miterlimit:10;}
.st4{fill:#FFDFAA;}
.st5{fill:#DEC192;}
.st6{fill:#FFDFAA;stroke:#FFDFAA;stroke-width:1.0703;stroke-miterlimit:10;}
.st7{fill:none;stroke:#FFDFAA;stroke-width:20;stroke-miterlimit:10;}
.st8{fill:none;stroke:#000000;stroke-width:25;stroke-linecap:round;stroke-linejoin:round;stroke-miterlimit:10;}

</style>